/*      Решение на второй урок java geekbrains

Я хотел представить очень развернутый и детальный ответ на каждую задачу. Если использовать один файл - будет не очень читабельно.
Здесь рещение каждой задачи выделено в отдельный класс с методом прогона теста(ов) и выводом результата.
Для удобства, условие задачи закомментировано в каждом классе.
*/

public class Lesson2 {
    public static void main(String[] args) {
        Task1.test();
        Task2.test();
        Task3.test();
        Task4.test();
        Task5.test();
        Task6.test();
        Task7.test();
    }
}